backend_advokiddo/app/controllers/application_controller.rb

    def logged_in?


        headers = request.headers["Authorization"]
        token = headers.split(" ")[1]

        begin
            user_id = JWT.decode(token, "se042020")[0]["user_id"]
            user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 250], ["LIMIT", 1]]