backend_advokiddo/app/controllers/children_controller.rb

    def create
        username = image_params[:username]
        user = User.all.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "asdf"], ["LIMIT", 1]]