backend_advokiddo/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
    def index
        images=Image.all

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "asdf"], ["LIMIT", 1]]
INSERT INTO "images" ("screen_shot", "user_id", "created_at", "updated_at", "child_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
    username = image_params[:username]
    user = User.all.find_by(username: username)
    url = uploadToCloudinary(image_params[:screen_shot])
    @image = Image.new(user_id: user.id, screen_shot: url, child_id: image_params[:child_id])

        if @image.save

SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 5]]
---
    def destroy
        image=Image.find(image_params[:id])
        image.destroy