backend_advokiddo/app/controllers/levels_controller.rb

INSERT INTO "levels" ("name", "child_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "LevelOne"], ["child_id", 62], ["created_at", "2021-01-12 15:25:19.320288"], ["updated_at", "2021-01-12 15:25:19.320288"]]
---
    def create
    @level = Level.new(child_id: level_params[:child_id], name: level_params[:name])

        if @level.save