backend_advokiddo/app/controllers/phrases_controller.rb

    def index
        phrases=Phrase.all
---
SELECT "phrases".* FROM "phrases"

    def create
        @phrase=Phrase.new(phrase_one: phrase_params[:phrase_one], phrase_two: phrase_params[:phrase_two], phrase_three: phrase_params[:phrase_three], user_id: phrase_params[:user_id], child_id: phrase_params[:child_id])

        if @phrase.save
---
INSERT INTO "phrases" ("child_id", "user_id", "phrase_one", "phrase_two", "phrase_three", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"