backend_advokiddo/app/controllers/prizes_controller.rb

SELECT "prizes".* FROM "prizes"
---
    def index
        prizes=Prize.all