backend_advokiddo/app/controllers/recordings_controller.rb

SELECT "recordings".* FROM "recordings"
---
        def index
            recordings=Recording.all

INSERT INTO "recordings" ("level_id", "child_id", "created_at", "updated_at", "audio") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
        def create
            # user = User.all.find_by(username: params[:username])
            # url = uploadToCloudinary(recording_params[:audio])
            @recording=Recording.new(child_id: recording_params[:child_id], level_id: recording_params[:level_id], audio: recording_params[:audio])

            if @recording.save